# Тип 2.
## Задание 1.
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
 
```
?	?	?	?	F
1	0	0	1	1
0			1	1
1	0		1
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (((x <= y) or (y == w)) and ((x or z) == w)):
                    print(x,y,z,w)

0 0 0 0
0 0 1 1
0 1 0 0
0 1 1 1
1 1 0 1
1 1 1 1

```
Ответ: zyxw

## Задание 2.
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ w. Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
    ???	            ???	            ???	            ???	           F
	                                                 1             0
1				                                                   0
1	                 1			                                   0
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not ((x and not y) or (y == z) or w):
                    print(x,y,z,w)
x y z w
0 0 1 0
0 1 0 0
1 1 0 0
```
Ответ: yxwz


## Задание 3.
Логическая функция F задаётся выражением (¬x ≡ z) → (y ≡ (w ∨ x)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

 

Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
	???				???				???				???			   F
	 0				 0								 			   0
	 0				 				 				 0			   0
	 0								 0				 0			   0
 

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not (not x == z) <= (y == (w or x)):
                    print (x,y,z,w)
0 0 1 1
0 1 1 0
1 0 0 0
1 0 0 1

```
Ответ: yxwz
