# Тип 2.
## Задание 1.
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
 
```
?	?	?	?	F
1	0	0	1	1
0			1	1
1	0		1
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (((x <= y) or (y == w)) and ((x or z) == w)):
                    print(x,y,z,w)

0 0 0 0
0 0 1 1
0 1 0 0
0 1 1 1
1 1 0 1
1 1 1 1

```
Ответ: zyxw

## Задание 2.
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ w. Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
    ???	            ???	            ???	            ???	           F
	                                                 1             0
1				                                                   0
1	                 1			                                   0
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not ((x and not y) or (y == z) or w):
                    print(x,y,z,w)
x y z w
0 0 1 0
0 1 0 0
1 1 0 0
```
Ответ: yxwz


## Задание 3.
Логическая функция F задаётся выражением (¬x ≡ z) → (y ≡ (w ∨ x)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

 

Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
	???				???				???				???			   F
	 0				 0								 			   0
	 0				 				 				 0			   0
	 0								 0				 0			   0
 

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not (not x == z) <= (y == (w or x)):
                    print (x,y,z,w)
0 0 1 1
0 1 1 0
1 0 0 0
1 0 0 1

```
Ответ: yxwz


# Тип 8
## Задание 1.
Все 5-⁠буквенные слова, составленные из букв В, И, Н, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:

1.  ВВВВВ
2.  ВВВВИ
3.  ВВВВН
4.  ВВВВТ
5.  ВВВИВ
...

Запишите слово, которое стоит под номером 1019.
```
a = 'ВИНТ'
counter = 0
for i in a:
    for j in a:
        for k in a:
            for l in a:
                for m in a:
                    s = i + j + k + l + m
                    counter += 1
                    if counter == 1019:
                        print(s)
ТТТНН
```
Ответ: ТТТНН

## Задание 2.
Все 4-⁠буквенные слова, составленные из букв С, Л, О, Н записаны в алфавитном порядке и пронумерованы.

Вот начало списка:

1.  ЛЛЛЛ
2.  ЛЛЛН
3.  ЛЛЛО
4.  ЛЛЛС
5.  ЛЛНЛ
...

Запишите слово, которое стоит под номером 250.
```
a = 'СЛОН'
k = 0
for i in a:
    for j in a:
        for g in a:
            for m in a:
                s = i + j + g + m
                k += 1
                if k == 250:
                    print (s)
ННОЛ
```
Ответ: ННОЛ

## Задание 3.
Все 5-⁠буквенные слова, составленные из букв А, К, Р, У, записаны в алфавитном порядке. Вот начало списка:

1.  ААААА
2.  ААААК
3.  ААААР
4.  ААААУ
5.  АААКА
...

Укажите номер первого слова, которое начинается с буквы К.
```
a = {0: "А", 1: "К", 2: "Р", 3: "У"}
k = 0
for i in a:
    for j in a:
        for g in a:
            for m in a:
                for n in a:
                    k += 1
                    if a[i] == "К":
                        print(k)
                        break
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
```
Ответ: 257
